In [1]:
import pandas as pd

In [6]:
df = pd.read_csv("random_italian_person/datasets/names.csv", index_col=0, header=1)

In [9]:
df["Nome"]= df["Nome"].apply(lambda x: " ".join([
    y.capitalize()
    for y in x.split(" ")
]) if not pd.isna(x) else "")

In [10]:
df.columns = ("")

                         Nome Sesso  Numero
0
1                    Giuseppe     M    1035
2                       Maria     F     962
3                      Andrea     M     848
4                       Marco     M     762
5                   Francesco     M     690
...                       ...   ...     ...
14552                 Blagica     F       1
14553  Roberta Marilena Piera     F       1
14554          Teresa Adriana     F       1
14555         Isabela Daniela     F       1
14556                Elia Son     M       1

[14556 rows x 3 columns]